{
  "name": "On the Rocks",
  "slug": "on-the-rocks",
  "colorTheme": "cyan",
  "data": [
    {
      "question": "Will we be friends in ten years?",
      "type": "Straight up"
    },
    {
      "question": "What personal demon are you in denial about?",
      "type": "This round's on me"
    },
    {
      "question": "What's something you think that I get away with, but that you never could?",
      "type": "Straight up"
    },
    {
      "question": "What is something you like about me that other people just don't appreciate?",
      "type": "Straight up"
    },
    {
      "question": "Tell us about a time you set something in motion and left the fallout for others to deal with.",
      "type": "Straight up"
    },
    {
      "question": "What's something you've always done - and only realized as an adult that it was weird?",
      "type": "Make it double"
    },
    {
      "question": "If you had to eat one delectable part of my delicious body, what part would you choose?",
      "type": "Straight up"
    },
    {
      "question": "When was the last time you lost your cool? What happened? How do you feel about it now?",
      "type": "Straight up"
    },
    {
      "question": "Describe me in three words from a language that you do not speak well.",
      "type": "Make it double"
    },
    {
      "question": "What's a grand gesture you tried to save or repair a relationship?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever been fired? If so, for what? If not, why not?",
      "type": "This round's on me"
    },
    {
      "question": "Our minds have traded bodies. What's the first thing you're going to do in my body?",
      "type": "Straight up"
    },
    {
      "question": "What's something you understand about your parents now that you're grown up? Do they know you know?",
      "type": "Straight up"
    },
    {
      "question": "Describe a time when you really thought you might die.",
      "type": "Make it double"
    },
    {
      "question": "Have you ever ghosted someone you were close with?",
      "type": "Straight up"
    },
    {
      "question": "Tell us what you wish you'd said during your last breakup, but didn't.",
      "type": "Straight up"
    },
    {
      "question": "What’s something about your personal hygiene that you could be more rigorous about?",
      "type": "This round's on me"
    },
    {
      "question": "Tell us what you do to annoy your partner on purpose.",
      "type": "Straight up"
    },
    {
      "question": "What's a place where you feel at home where I would absolutely not fit in?",
      "type": "Straight up"
    },
    {
      "question": "Tell us about a time you got more wasted than was advisable.",
      "type": "Make it double"
    },
    {
      "question": "What is your worst coping mechanism? Defense mechanism?",
      "type": "Straight up"
    },
    {
      "question": "Assuming you were single, what would it take for you to get back together with your last ex?",
      "type": "Straight up"
    },
    {
      "question": "Do your best (or worst) impersonation of me. I promise to clap appreciatively.",
      "type": "Make it double"
    },
    {
      "question": "Have you broken any bones? What happened? Did you hear the crack?",
      "type": "Straight up"
    },
    {
      "question": "What’s something that you do that you wonder if other people do too, but don’t know for certain?",
      "type": "This round's on me"
    },
    {
      "question": "Write me a new dating app bio in three sentences or less.",
      "type": "Make it double"
    },
    {
      "question": "I get a news alert that instantly makes me extremely happy — but no one else here cares. What’s the news?",
      "type": "Straight up"
    },
    {
      "question": "What’s my greatest physical asset? Don’t be shy.",
      "type": "This round's on me"
    },
    {
      "question": "If I could help you with one unpleasant task, what would it be? What makes me the right choice for the job?",
      "type": "Straight up"
    },
    {
      "question": "Tell me about a disagreement we had and how we resolved it. Has it made us stronger?",
      "type": "Straight up"
    },
    {
      "question": "Tell us about a time you observed me lying to someone else. Was it the right thing to do?",
      "type": "Straight up"
    },
    {
      "question": "We’re starting a business. What venture would we be most successful at as a pair?",
      "type": "Straight up"
    },
    {
      "question": "Describe the last time you were out of control.",
      "type": "This round's on me"
    },
    {
      "question": "Have you ever dated a friend’s ex? Ever wanted to?",
      "type": "Straight up"
    },
    {
      "question": "Describe your worst bathroom-related disaster.",
      "type": "Make it double"
    },
    {
      "question": "What have you borrowed from me and still not returned? Can I have it back right now?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever shared a piece of information that you realized too late was probably supposed to be a secret?",
      "type": "Straight up"
    },
    {
      "question": "Tell us about a time you were shot down romantically.",
      "type": "This round's on me"
    },
    {
      "question": "Of all the things we do together, what is the best thing we do together?",
      "type": "Straight up"
    },
    {
      "question": "I don’t know why you put up with me! Why do you keep me around?",
      "type": "Make it double"
    },
    {
      "question": "What have I ruined for you?",
      "type": "Straight up"
    },
    {
      "question": "What did you get in major trouble for doing as a kid, and did you ever learn your lesson?",
      "type": "Straight up"
    },
    {
      "question": "Name a time you could have helped someone, but didn’t bother.",
      "type": "Make it double"
    },
    {
      "question": "What’s the worst thing you’ve ever had to do at work or school? How’d you handle it?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever sat back and watched me confidently do something incorrectly?",
      "type": "Straight up"
    },
    {
      "question": "What’s something you did for free as a favor, that in retrospect, you really wish you’d charged for?",
      "type": "Straight up"
    },
    {
      "question": "Do you ever pity laugh at my jokes, even if you don’t think they’re funny?",
      "type": "Straight up"
    },
    {
      "question": "If you could have any body part of mine (for aesthetic, not medical, reasons), what would it be?",
      "type": "Straight up"
    },
    {
      "question": "Would you ever see a band that you hated in concert, just to make me happy? Have you?",
      "type": "Straight up"
    },
    {
      "question": "What are your vices? Have they gotten better or worse over time?",
      "type": "This round's on me"
    },
    {
      "question": "What interest have you given up due to a community you didn’t want to be a part of?",
      "type": "Straight up"
    },
    {
      "question": "Tell us about a time you shot someone down romantically.",
      "type": "Straight up"
    },
    {
      "question": "If I were in a relationship with someone you hated, would you tell me?",
      "type": "Straight up"
    },
    {
      "question": "Do you think I’m capable of doing something you could never forgive me for?",
      "type": "Straight up"
    },
    {
      "question": "Science has advanced, and now you and I are raising our five-year-old together. How are we doing? What is the kid like?",
      "type": "Straight up"
    },
    {
      "question": "What’s a piece of pop culture that makes you suspicious of anyone who is a fan?",
      "type": "This round's on me"
    },
    {
      "question": "If I killed somebody, under what circumstances would you help me cover it up?",
      "type": "Straight up"
    },
    {
      "question": "Someone who’s never met me asks you what I’m like. How do you answer?",
      "type": "Straight up"
    },
    {
      "question": "If we were to meet for the first time today, would we become friends?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever stolen anything? What, and why? Do you still have it?",
      "type": "Make it double"
    },
    {
      "question": "Has your ego ever gotten in the way of apologizing or patching up a fight? Did you ever resolve it?",
      "type": "Straight up"
    },
    {
      "question": "What was your most embarrassing moment that transpired in public? Let’s all relive it!",
      "type": "Make it double"
    },
    {
      "question": "What is your favorite memory of our relationship?",
      "type": "Straight up"
    },
    {
      "question": "What is (or would be) the worst thing about having me as a travel companion?",
      "type": "Straight up"
    },
    {
      "question": "What’s a comment someone made about you that burned itself into your mind and forever altered your behavior?",
      "type": "This round's on me"
    },
    {
      "question": "What’s something you avoid because you’re afraid you’ll enjoy it too much?",
      "type": "Make it double"
    },
    {
      "question": "Do you think you are more or less attractive than the average person? Why?",
      "type": "Straight up"
    },
    {
      "question": "What’s your most expensive mistake?",
      "type": "Make it double"
    },
    {
      "question": "We’re road tripping through the middle of nowhere. Do you have me drive or navigate?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever done something with the goal of impressing specifically me?",
      "type": "Straight up"
    },
    {
      "question": "What’s the biggest lie you’ve ever come up with to cancel plans?",
      "type": "Make it double"
    },
    {
      "question": "How are we wrong for each other romantically?",
      "type": "Straight up"
    },
    {
      "question": "What's an offense you’ve committed that could get you fired from work?",
      "type": "This round's on me"
    },
    {
      "question": "Describe my perfect life partner. Have I been on the right track to find this person?",
      "type": "Straight up"
    },
    {
      "question": "Which of us do you think has committed more crimes?",
      "type": "Straight up"
    },
    {
      "question": "Describe the first time we met. What was your honest first impression of me?",
      "type": "Make it double"
    },
    {
      "question": "If I listed you as my job reference, what would you say about me? Would it all be true?",
      "type": "Straight up"
    },
    {
      "question": "What have you learned from me?",
      "type": "Make it double"
    },
    {
      "question": "How would your life be worse if we had never met?",
      "type": "Make it double"
    },
    {
      "question": "How long did it take you to get over your last ex? What did you do to get over it? Are you actually over it?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever just let me win?",
      "type": "Straight up"
    },
    {
      "question": "What’s a habit, compulsion, or relationship you wish you could quit?",
      "type": "This round's on me"
    },
    {
      "question": "What’s something I talked you out of doing, and it was the right call?",
      "type": "Straight up"
    },
    {
      "question": "Who’s the smartest person here? Make your case.",
      "type": "Straight up"
    },
    {
      "question": "When was the last time you cried? What happened?",
      "type": "Straight up"
    },
    {
      "question": "What do you wish you were as good at as me?",
      "type": "Make it double"
    },
    {
      "question": "You and I are dating. What’s going to break us up?",
      "type": "Straight up"
    },
    {
      "question": "Was your childhood happier than the average person’s?",
      "type": "Straight up"
    },
    {
      "question": "What’s something you’re self-conscious about? Are you working on it?",
      "type": "Straight up"
    },
    {
      "question": "Have you been blocked by any celebrities on social media? Tell us the story!",
      "type": "This round's on me"
    },
    {
      "question": "Every friendship involves give-and-take. Which one am I?",
      "type": "Straight up"
    },
    {
      "question": "If I didn't have my current job, what do you see me doing?",
      "type": "Make it double"
    },
    {
      "question": "If someone important to you said they’d stop seeing you unless you stopped seeing me, would you?",
      "type": "Straight up"
    },
    {
      "question": "What’s the longest period of time you could share a hotel room with me before never wanting to see me again?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever seen me charm my way out of trouble?",
      "type": "Straight up"
    },
    {
      "question": "Tell us about a secret you had to keep from your loved ones.",
      "type": "This round's on me"
    },
    {
      "question": "What would you never hire me to do?",
      "type": "Straight up"
    },
    {
      "question": "Describe a time when you really disappointed someone. Did you ever earn back their trust?",
      "type": "Straight up"
    },
    {
      "question": "If I were a chain restaurant, which one would I be and why?",
      "type": "Make it double"
    }
  ]
}
