{
  "name": "Extra Dirty",
  "slug": "extra-dirty",
  "colorTheme": "red",
  "sortOrder": 40,
  "data": [
    {
      "question": "What's the most surprising discovery you've made about your own body?",
      "type": "Straight up"
    },
    {
      "question": "You can send a message back in time to your teenage self about sex. What advice will you impart?",
      "type": "Make it double"
    },
    {
      "question": "Are you a good kisser? How do you know?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever had to contact past partners for... public health reasons?",
      "type": "Straight up"
    },
    {
      "question": "Describe your nipples as vividly as possible. Use a size comparison. Dimes or dinner plates?",
      "type": "This round's on me"
    },
    {
      "question": "What's the sex skill you're most proud of?",
      "type": "Make it double"
    },
    {
      "question": "What's a sexual thing you gave a good try, but just couldn't get into?",
      "type": "Straight up"
    },
    {
      "question": "Do you have any porn actually downloaded and saved on your phone? What emergency are you preparing for?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever had sex with someone who was already in a committed relationship?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever walked in on your parents doing that thing that grownups do when they love each other very much?",
      "type": "This round's on me"
    },
    {
      "question": "Give us a passionate example of your dirty talk.",
      "type": "Make it double"
    },
    {
      "question": "What's the weirdest porn you've ever clicked on? Did you watch the whole thing, or just enough?",
      "type": "Straight up"
    },
    {
      "question": "When was the last time you masturbated? Were you a good lay? Any notes for yourself for next time?",
      "type": "This round's on me"
    },
    {
      "question": "Do you see yourself committing to one sexual partner for the rest of your life?",
      "type": "Straight up"
    },
    {
      "question": "If you and I were in a porn together, what would its clickbait title be? Would it live up to that promise?",
      "type": "Straight up"
    },
    {
      "question": "Tell us about an awkward or unexpected sex dream you've had. Was anyone here involved?",
      "type": "Straight up"
    },
    {
      "question": "Inadvertent nudity. Tell us about when it happened to you.",
      "type": "Make it double"
    },
    {
      "question": "Who's had more sex, you or your parents?",
      "type": "Straight up"
    },
    {
      "question": "Tell us about the first time you ever saw porn. Did you seek it out, or did you just happen upon it?",
      "type": "Straight up"
    },
    {
      "question": "Describe one of the finest and most memorable orgasms you ever had. What were the conditions?",
      "type": "This round's on me"
    },
    {
      "question": "Have you ever slid into someone's DMs? Any techniques you want to share?",
      "type": "Straight up"
    },
    {
      "question": "Do you find me physically attractive? What if I bat my eyelashes like this?",
      "type": "Straight up"
    },
    {
      "question": "How much money would a voyeuristic billionaire have to pay us for us to have sex for their entertainment?",
      "type": "Straight up"
    },
    {
      "question": "Where's the strangest place you've had sex?",
      "type": "Make it double"
    },
    {
      "question": "Have you ever gotten down in public?",
      "type": "Straight up"
    },
    {
      "question": "Who do you think has had more sexual partners, you or me?",
      "type": "This round's on me"
    },
    {
      "question": "Have you ever feared for your life or safety while drinking or on drugs? Take us to the scene.",
      "type": "Straight up"
    },
    {
      "question": "Describe the perfect foreplay: what activities, and for how long?",
      "type": "Straight up"
    },
    {
      "question": "What's the maximum number of people you'd be interested in having sex with at once?",
      "type": "This round's on me"
    },
    {
      "question": "Are you more sexperimental, or less sexperimental, than the average person?",
      "type": "Straight up"
    },
    {
      "question": "What would it take for us to have sex, right here, right now? With everyone watching?",
      "type": "Make it double"
    },
    {
      "question": "What are (or would be) your ground rules for an open relationship?",
      "type": "Straight up"
    },
    {
      "question": "How confident are you in your sexual orientation? Have you ever experimented ouside of it, or considered it? Do you think you ever will?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever had a one-night stand? Did you know their last name, and do you remember it now?",
      "type": "This round's on me"
    },
    {
      "question": "What's your most-complimented anatomical feature (as described by your lovers?)",
      "type": "Straight up"
    },
    {
      "question": "If you can abstain from sex and masturbation for one full year, you'll win $27,000 and a nice used car. Will you make it?",
      "type": "Straight up"
    },
    {
      "question": "How did your parents talk to you about sex? Did you learn more about it from them or elsewhere?",
      "type": "Straight up"
    },
    {
      "question": "Food and sex. Tell us about an experience involving both.",
      "type": "Make it double"
    },
    {
      "question": "List all the illicit drugs you've tried. Which others would you like to try?",
      "type": "Straight up"
    },
    {
      "question": "We're all making a porn together! Who among us stars, who writes, who directs...? Assign jobs to everyone here.",
      "type": "Straight up"
    },
    {
      "question": "Have you ever cheated on anyone? What were the circumstances?",
      "type": "Straight up"
    },
    {
      "question": "Eating ass. Have you done it, or had it done to you? Tell us everything.",
      "type": "This round's on me"
    },
    {
      "question": "Do you need an emotional connection to have great sex? If you've had a spectacular hookup that was purely physical, tell us everything.",
      "type": "Straight up"
    },
    {
      "question": "Assuming we were both single, would you hook up with me? How desperate would you have to be?",
      "type": "This round's on me"
    },
    {
      "question": "Tell us about a time in which a romantic partner just didn't understand how to do a certain sex thing.",
      "type": "Straight up"
    },
    {
      "question": "What's the best compliment you've ever gotten on your sexual performance?",
      "type": "Make it double"
    },
    {
      "question": "How many people have you hooked up with off dating apps?",
      "type": "This round's on me"
    },
    {
      "question": "If a studio were to make porn specifically for you, tailored to your specific tastes, what would it be like?",
      "type": "Straight up"
    },
    {
      "question": "What's a sex thing you've never been able to try, but wish you could?",
      "type": "This round's on me"
    },
    {
      "question": "If your sex life was a pie chart, what portion of it would be: satisfactory, unsatisfactory, and mind-blowing?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever paid for porn? If not, how much do you owe the porn industry? You know those people work hard.",
      "type": "Straight up"
    },
    {
      "question": "Describe the present state of your pubic hair.",
      "type": "This round's on me"
    },
    {
      "question": "If I cheat on my partner, is it absolutely essential that I tell them? Why or why not?",
      "type": "Straight up"
    },
    {
      "question": "Would you be (or have you been) a “guest star” in another couple's bedroom?",
      "type": "Straight up"
    },
    {
      "question": "What scared you the most about sex as you were coming of age?",
      "type": "Make it double"
    },
    {
      "question": "Do you have recurring fantasies that surprise you? Would they surprise us? Try us.",
      "type": "Straight up"
    },
    {
      "question": "What is your favorite sexual position and why?",
      "type": "Straight up"
    },
    {
      "question": "What's the biggest mess you've created during sex? Did you have to clean it up, or did you leave it for someone else?",
      "type": "Make it double"
    },
    {
      "question": "Have you ever sent nudes? How do you compose, frame, and light these images?",
      "type": "This round's on me"
    },
    {
      "question": "How open are you about your most intimate fantasies with your partner(s)?",
      "type": "Straight up"
    },
    {
      "question": "Do you think you're better suited to open relationships or monogamy? Have you tried each?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever paid for sex work? Would you?",
      "type": "Straight up"
    },
    {
      "question": "Which of your hookups created the most drama? Was there permanent fallout?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever had a threesome? If you haven't yet, build your ideal trio.",
      "type": "This round's on me"
    },
    {
      "question": "Who was the last person (besides your partner or your kids) whose junk you've seen?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever worn someone else's underwear, accidentally or on purpose? What was the circumstance?",
      "type": "Straight up"
    },
    {
      "question": "Are you loud during sex? Demonstrate with a dramatic interpretation of your signature sex sounds.",
      "type": "Make it double"
    },
    {
      "question": "Have you ever cried after - or during - sex? Were they tears of joy, love, or utter disappointment?",
      "type": "Straight up"
    },
    {
      "question": "What's the last object you put inside yourself or another person?",
      "type": "This round's on me"
    },
    {
      "question": "Have you ever been caught masturbating or having sex?",
      "type": "This round's on me"
    },
    {
      "question": "Have I gotten sexier since you've known me?",
      "type": "This round's on me"
    },
    {
      "question": "What sex-related word are you not sure how to pronounce?",
      "type": "Straight up"
    },
    {
      "question": "Did you ever filmed yourself having sex? What did you do with the footage?",
      "type": "Straight up"
    },
    {
      "question": "How would your partner (or your most recent ex) describe your sex life with a movie title?",
      "type": "Make it double"
    },
    {
      "question": "What's something you wish your ex would have done sexually, but didn't?",
      "type": "Straight up"
    },
    {
      "question": "What would it take for you to sleep with someone you're not at all physically attracted to?",
      "type": "Straight up"
    },
    {
      "question": "How confident are you in your oral sex skills? What feedback have you gotten?",
      "type": "Straight up"
    },
    {
      "question": "Looking for a weird but true story about an inappropriate boner.",
      "type": "This round's on me"
    },
    {
      "question": "Describe your sex life with a movie title, and tell us your reasoning.",
      "type": "Make it double"
    },
    {
      "question": "Describe your sex life with a song title.",
      "type": "Make it double"
    },
    {
      "question": "What's the most creative you've ever had to get in order to smash? What was standing in your way, and how did you solve it?",
      "type": "Straight up"
    },
    {
      "question": "Imagine we're your future (or current) children. Tell us how babies are made.",
      "type": "Straight up"
    },
    {
      "question": "Who here do you think you'd be most sexually compatible with? Present and past partners excluded. Remember, this is just hypothetical.",
      "type": "This round's on me"
    },
    {
      "question": "What did you observe from porn that you later realized was unrealistic? How'd you make this discovery?",
      "type": "Straight up"
    },
    {
      "question": "Do you have a go-to sex move? Where did you learn it?",
      "type": "Make it double"
    },
    {
      "question": "Who was the last person (besides your partner or your doctor) who's seen your junk?",
      "type": "Straight up"
    },
    {
      "question": "If you had to write a quick-start guide to getting you off, what are the key bullet points?",
      "type": "Straight up"
    },
    {
      "question": "What's the kinkiest thing you've asked someone else to do? Did they oblige?",
      "type": "Straight up"
    },
    {
      "question": "If we were stuck on a desert island, how many days until we fuck out of boredom?",
      "type": "Straight up"
    },
    {
      "question": "Have you ever been injured during sex? Or injured someone else? Heartbreaks don't count.",
      "type": "This round's on me"
    },
    {
      "question": "Quick! Name your favorite porn star. And tell us about all the wonderful qualities that make them special.",
      "type": "Straight up"
    },
    {
      "question": "If I had a hot sibling, would they be off-limits, sex-wise?",
      "type": "This round's on me"
    },
    {
      "question": "If I had a hot parent, would you let them seduce you?",
      "type": "Straight up"
    },
    {
      "question": "What will be the sexy nickname they give you when you live at the old-folks' home?",
      "type": "Make it double"
    },
    {
      "question": "Describe your first time having sex. Include every cringey detail.",
      "type": "This round's on me"
    },
    {
      "question": "When was the last time you were tested for a sexually transmitted infection? What were the results?",
      "type": "This round's on me"
    },
    {
      "question": "On the spectrum of “sober as a judge” to “falling-down drunk,” where do you have the best sex?",
      "type": "Straight up"
    },
    {
      "question": "Do you have an age ceiling for a one-night stand?",
      "type": "Straight up"
    },
    {
      "question": "Who here would have the best sexual chemistry with me? Based upon what evidence?",
      "type": "This round's on me"
    }
  ]
}
